eisup_2019_docmng_integration/src/InformationRegisters/абс_ПределыСуммУтверждения/абс_ПределыСуммУтверждения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_ПределыСуммУтверждения</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ПределСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидБП</name>
    <type>
      <types>EnumRef.абсВидыБизнесПроцессовТТК</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Роль</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/абсВидыБизнесПроцессовТТК/абсВидыБизнесПроцессовТТК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абсВидыБизнесПроцессовТТК</name>
  <enumValues>
    <name>СогласованиеКонтрагентов</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДоговоров</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеЗакупочныхЗаказов</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеСчетовНаОплату</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПервичныхДокументов</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеЗаявкиНаСклад</name>
  </enumValues>
  <enumValues>
    <name>РекласификацияБюджета</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкиВПоддержку</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПланаБюджета</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаНаИзменениеРеквизитов</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеНоменклатурныхГрупп</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеСтатейЗатрат</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДоговоровПодряда</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеАктовПриёмкиВыполненныхРабот</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеЗаявокНаПроект</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеСчетовНаОплатуФилиализация</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/InformationRegisters/абс_ПределыСуммУтверждения/ManagerModule.bsl
Функция ПолучитьСтруктуруСогласованияФилиализация(СуммаСчета)  Экспорт
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	абс_ПределыСуммУтвержденияСрезПоследних.Роль
	 |ИЗ
	 |	РегистрСведений.абс_ПределыСуммУтверждения.СрезПоследних КАК абс_ПределыСуммУтвержденияСрезПоследних
	 |ГДЕ
	 |	абс_ПределыСуммУтвержденияСрезПоследних.ПределСумма <= &СуммаСчета
	 |	И абс_ПределыСуммУтвержденияСрезПоследних.ВидБП = &ВидБП";
	 
	 Запрос.УстановитьПараметр("ВидБП", Перечисления.абсВидыБизнесПроцессовТТК.СогласованиеСчетовНаОплатуФилиализация);
	 Запрос.УстановитьПараметр("СуммаСчета", СуммаСчета);
	 
	 Возврат Запрос.Выполнить().Выгрузить();
	 
 КонецФункции
